insert into public.regions (id_region, region) values
  (0, 'Непосочен регион'),
  (1, 'Благоевград'),
  (2, 'Бургас'),
  (3, 'Варна'),
  (4, 'Велико Търново'),
  (5, 'Видин'),
  (6, 'Враца'),
  (7, 'Габрово'),
  (8, 'Добрич'),
  (9, 'Кърджали'),
  (10, 'Кюстендил'),
  (11, 'Ловеч'),
  (12, 'Монтана'),
  (13, 'Пазарджик'),
  (14, 'Перник'),
  (15, 'Плевен'),
  (16, 'Пловдив'),
  (17, 'Разград'),
  (18, 'Русе'),
  (19, 'Силистра'),
  (20, 'Сливен'),
  (21, 'Смолян'),
  (22, 'Софийска област'),
  (23, 'София – град'),
  (24, 'Стара Загора'),
  (25, 'Търговище'),
  (26, 'Хасково'),
  (27, 'Шумен'),
  (28, 'Ямбол')
on conflict (id_region) do nothing;

update public.regions
set region = 'София – град'
where id_region = 23 and region is distinct from 'София – град';